lab11/nrf5x-base/lib/simple_ble.c
/*
 * BLE setup functions
 */

// Standard Libraries
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <string.h>

// Nordic Libraries
#include "nordic_common.h"
#include "ble.h"
#include "ble_db_discovery.h"
#include "app_util.h"
#include "app_error.h"
#include "ble_conn_params.h"
#include "ble_hci.h"
#include "ble_hrs_c.h"
#include "ble_bas_c.h"
#include "app_util.h"
#include "app_timer.h"
#include "softdevice_handler.h"
#include "nrf_sdm.h"

// device firmware update code
#ifdef ENABLE_DFU
#include "ble_dfu.h"
#include "bootloader_types.h"
#include "bootloader_util.h"
#include "bootloader.h"
#endif

// Simple BLE files
#include "simple_ble.h"
#include "device_info_service.h"

#ifdef ENABLE_DFU
// Defines
#define IRQ_ENABLED               0x01
#define MAX_NUMBER_INTERRUPTS     32
#define BOOTLOADER_BLE_ADDR_START 0x20007F80
#define DFU_ADV_DATA_TYPE         0x16
#define DFU_ADV_DATA_VERS         0x01
#endif

/*******************************************************************************
 *   STATIC AND GLOBAL VARIABLES
 ******************************************************************************/
static const simple_ble_config_t* ble_config;

simple_ble_app_t app;
ble_gap_adv_params_t m_adv_params;
ble_gap_sec_params_t m_sec_params = {
    SEC_PARAM_BOND,
    SEC_PARAM_MITM,
#ifdef SOFTDEVICE_s130
    SEC_PARAM_LESC,
    SEC_PARAM_KEYPRESS,
#endif
    SEC_PARAM_IO_CAPABILITIES,
    SEC_PARAM_OOB,
    SEC_PARAM_MIN_KEY_SIZE,
    SEC_PARAM_MAX_KEY_SIZE,
#ifdef SOFTDEVICE_s130
    {0, 0, 0, 0},
    {0, 0, 0, 0}
#endif
};

// configuration settings that can be redefined by application
__attribute__((weak)) const int SLAVE_LATENCY = 0;
__attribute__((weak)) const int CONN_SUP_TIMEOUT = MSEC_TO_UNITS(4000, UNIT_10_MS);
__attribute__((weak)) const int FIRST_CONN_PARAMS_UPDATE_DELAY = APP_TIMER_TICKS(1000, APP_TIMER_PRESCALER);

#ifdef ENABLE_DFU
static simple_ble_service_t dfu_service = {
    .uuid128 =  {{0x23, 0xD1, 0xBC, 0xEA, 0x5F, 0x78, 0x23, 0x15,
                  0xDE, 0xEF, 0x12, 0x12, 0x00, 0x00, 0x00, 0x00}},
    .uuid_handle.uuid = BLE_DFU_SERVICE_UUID};

static simple_ble_char_t    dfu_ctrlpt_char = {.uuid16 = BLE_DFU_CTRL_PT_UUID};

static bool pending_dfu = 0;
#endif

/*******************************************************************************
 *   FUNCTION PROTOTYPES
 ******************************************************************************/
static void conn_params_error_handler(uint32_t nrf_error);
static void ble_evt_dispatch(ble_evt_t * p_ble_evt);
static void sys_evt_dispatch(uint32_t sys_evt);
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt);
static void on_ble_evt(ble_evt_t * p_ble_evt);
#ifdef ENABLE_DFU
static void dfu_reset();
#endif

void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name);
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name);


/*******************************************************************************
 *   HANDLERS AND CALLBACKS
 ******************************************************************************/

// Default weak references for callbacks
//
// All of these callbacks are optional. By declaring prototypes with weak
// references here, these will turn into pointes with value 0 (definition of
// behavoir for weak references with forward declaration but no implementation)
// rather than link time failures.
//
// Run-time code must check that these functions are valid before calling.
void __attribute__((weak)) ble_evt_connected(ble_evt_t* p_ble_evt);
void __attribute__((weak)) ble_evt_disconnected(ble_evt_t* p_ble_evt);
void __attribute__((weak)) ble_evt_write(ble_evt_t* p_ble_evt);
void __attribute__((weak)) ble_evt_rw_auth(ble_evt_t* p_ble_evt);
void __attribute__((weak)) ble_evt_user_handler(ble_evt_t* p_ble_evt);
void __attribute__((weak)) ble_evt_adv_report(ble_evt_t* p_ble_evt);
void __attribute__((weak)) ble_error(uint32_t error_code);


#ifndef SOFTDEVICE_s130 // This function is called app_error_fault_handler in the SDK 11
void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name) {
#else
void __attribute__((weak)) app_error_fault_handler(uint32_t error_code, __attribute__ ((unused)) uint32_t line_num, __attribute__ ((unused)) uint32_t info) {
#endif
    // APPL_LOG("[APPL]: ASSERT: %s, %d, error 0x%08x\r\n", p_file_name, line_num, error_code);

    // This call can be used for debug purposes during development of an application.
    // @note CAUTION: Activating this code will write the stack to flash on an error.
    //                This function should NOT be used in a final product.
    //                It is intended STRICTLY for development/debugging purposes.
    //                The flash write will happen EVEN if the radio is active, thus interrupting
    //                any communication.
    //                Use with care. Un-comment the line below to use.
    // ble_debug_assert_handler(error_code, line_num, p_file_name);

    // On assert, the system can only recover with a reset.
    //NVIC_SystemReset();

    // callback for user
    if (ble_error) {
        ble_error(error_code);
    }
    while(1);
}

void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name) {
    app_error_handler(0xDEADBEEF, line_num, p_file_name);
}

static void conn_params_error_handler(uint32_t nrf_error) {
    APP_ERROR_HANDLER(nrf_error);
}

static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    on_ble_evt(p_ble_evt);
    ble_conn_params_on_ble_evt(p_ble_evt);
}

static void sys_evt_dispatch(__attribute__ ((unused)) uint32_t sys_evt) {
}

static void on_conn_params_evt(ble_conn_params_evt_t * p_evt) {
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED) {
        err_code = sd_ble_gap_disconnect(app.conn_handle,
                BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}

#ifdef ENABLE_DFU
static void interrupts_disable(void) {
    uint32_t interrupt_setting_mask;
    uint32_t irq = 0; // We start from first interrupt, i.e. interrupt 0.

    // Fetch the current interrupt settings.
    interrupt_setting_mask = NVIC->ISER[0];

